<?php

/**

 * 接口错误码

 *

 */

$config['error_code'] = array(

    //接口级别错误

    1001  => '文件错误',

    1002  => '接口错误',

    1003  => '环境错误',

    //环境级别错误

    2001  => 'Redis错误',

    2002  => 'Redis无法连接',

    2003  => '暂未启用Redis数据处理，请先关闭',

    2004 => '数据库连接错误',



    //业务级别错误

    3001  => '参数错误',

    3002  => '发送失败，60秒内不允许重复发送！',

    3003  => '当天发送短信次数已被限制，请第二天后再尝试！',

    3004  => '发送失败,请联系管理人员查看！',

    3005  => '验证码错误！',

    3006  => '该手机号码已注册，请勿重复注册！',

    3007  => '注册失败，请联系管理员或稍后尝试！',

    3008  => '用户名或密码无效！',

    3009  => '注册成功，登录失败，请尝试重新登录！',

    3010  => '用户不存在！',

    3011  => '重置失败，请联系管理人员查看或稍后再试！',





    //权限认证错误

    4001  => '认证失败',

    4002  => '认证不通过',

    4003  => '口令错误',

    4004  => '请求次数已达上限',

    4005  => '请求被禁止',

    4006  => '接口配置错误',

    4007  => 'Illegal access',



    //收发存报表异常

    5001 => '查询时间异常,时间区间不允许跨年或为空！',

    5002 => '当产品编码为空时,时间区间不允许跨月！',



    //产品信息

    6001 =>'对不起,您还没有发布产品',

    6002 =>'添加产品失败',

    6003 =>'回撤失败,请检查产品是否已审核!',

    6004 =>'该供应商已禁用,暂时不能发布产品,详情请联系管理人员!',

    6005 =>'该账号未绑定供应商,请先绑定供应商!',



    //供应商模块

    7001 =>'资料提交失败，请重新检查后重新提交!',

    7002 =>'供应商资料已存在，不能重复提交!',

    7003 =>'未知错误，请联系管理员!',

    7004 =>'资料修改失败!',
	
    7005 =>'非法用户!',
);